In [116]:
import pandas as pd
df=pd.read_csv("data.csv")

In [117]:
df

   Transaction_ID Customer_Name  Amount($)        Date     Category
0             101         Alice     250.50  2025-03-01  Electronics
1             102           Bob        NaN  2025-02-28    Groceries
2             103       Charlie    -100.00  2025-03-02      Fashion
3             104         Alice     250.50  2025-03-01  Electronics
4             105         David      89.99  Not a Date      Fashion

In [118]:
df["Amount($)"].fillna(df["Amount($)"].mean(), inplace=True)
df

   Transaction_ID Customer_Name  Amount($)        Date     Category
0             101         Alice   250.5000  2025-03-01  Electronics
1             102           Bob   122.7475  2025-02-28    Groceries
2             103       Charlie  -100.0000  2025-03-02      Fashion
3             104         Alice   250.5000  2025-03-01  Electronics
4             105         David    89.9900  Not a Date      Fashion

In [119]:
df=df.drop_duplicates(subset=["Customer_Name"])

In [120]:
df

   Transaction_ID Customer_Name  Amount($)        Date     Category
0             101         Alice   250.5000  2025-03-01  Electronics
1             102           Bob   122.7475  2025-02-28    Groceries
2             103       Charlie  -100.0000  2025-03-02      Fashion
4             105         David    89.9900  Not a Date      Fashion

In [121]:
df=df[df["Amount($)"]>0]
df

   Transaction_ID Customer_Name  Amount($)        Date     Category
0             101         Alice   250.5000  2025-03-01  Electronics
1             102           Bob   122.7475  2025-02-28    Groceries
4             105         David    89.9900  Not a Date      Fashion

In [122]:
df

   Transaction_ID Customer_Name  Amount($)        Date     Category
0             101         Alice   250.5000  2025-03-01  Electronics
1             102           Bob   122.7475  2025-02-28    Groceries
4             105         David    89.9900  Not a Date      Fashion

In [123]:
df["Date"]=pd.to_datetime(df["Date"],errors="coerce")

C:\Users\Shreyasi Ghosh\AppData\Local\Temp\ipykernel_13960\47515394.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Date"]=pd.to_datetime(df["Date"],errors="coerce")

In [124]:
df=df.dropna(subset=["Date"])

In [125]:
df

   Transaction_ID Customer_Name  Amount($)       Date     Category
0             101         Alice   250.5000 2025-03-01  Electronics
1             102           Bob   122.7475 2025-02-28    Groceries

In [126]:
#next

In [153]:
new=pd.read_csv("churn.csv")
new

   CustomerID  Age  Monthly_Charges  Total_Charges  Tenure  Target
0        1001   25            29.99          150.0       5       0
1        1002   40            79.99         2000.0      24       1
2        1003   35            55.00         1000.0      18       0
3        1004   50            95.00         4500.0      48       1
4        1005   28              NaN          300.0       6       0

In [154]:
new["Monthly_Charges"].fillna(new["Monthly_Charges"].mean(),inplace=True)

In [155]:
new

   CustomerID  Age  Monthly_Charges  Total_Charges  Tenure  Target
0        1001   25           29.990          150.0       5       0
1        1002   40           79.990         2000.0      24       1
2        1003   35           55.000         1000.0      18       0
3        1004   50           95.000         4500.0      48       1
4        1005   28           64.995          300.0       6       0

In [156]:
new=new.drop_duplicates()

In [157]:
new

   CustomerID  Age  Monthly_Charges  Total_Charges  Tenure  Target
0        1001   25           29.990          150.0       5       0
1        1002   40           79.990         2000.0      24       1
2        1003   35           55.000         1000.0      18       0
3        1004   50           95.000         4500.0      48       1
4        1005   28           64.995          300.0       6       0

In [178]:
from sklearn.metrics import accuracy_score,classification_report
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
import numpy as np

In [179]:
X = new[["Age", "Monthly_Charges", "Total_Charges", "Tenure"]]

In [180]:
Y=new["Target"]

In [181]:
X_train,X_test,Y_train,Y_test=train_test_split(X,Y,test_size=0.3)
model= LogisticRegression()
model.fit(X_train,Y_train)
y_pred=model.predict(X_test)
accuracy=accuracy_score(y_pred,Y_test)
cls=classification_report(y_pred,Y_test)

c:\Users\Shreyasi Ghosh\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\metrics\_classification.py:1469: UndefinedMetricWarning: Recall and F-score are ill-defined and being set to 0.0 in labels with no true samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))
c:\Users\Shreyasi Ghosh\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\metrics\_classification.py:1469: UndefinedMetricWarning: Recall and F-score are ill-defined and being set to 0.0 in labels with no true samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))
c:\Users\Shreyasi Ghosh\AppData\Local\Programs\Python\Python311\Lib\site-packages\sklearn\metrics\_classification.py:1469: UndefinedMetricWarning: Recall and F-score are ill-defined and being set to 0.0 in labels with no true samples. Use `zero_division` parameter to control this behavior.
  _warn_prf(average, modifier, msg_start, len(result))

In [183]:
print(f"Model Accuracy: {accuracy:.2f}")
print("Classification Report:\n", cls)

Model Accuracy: 0.50
Classification Report:
               precision    recall  f1-score   support

           0       1.00      0.50      0.67         2
           1       0.00      0.00      0.00         0

    accuracy                           0.50         2
   macro avg       0.50      0.25      0.33         2
weighted avg       1.00      0.50      0.67         2